## Payroll script notebook

In [4]:
import pandas as pd
from openpyxl import Workbook

In [5]:
# import timesheets summary csv from Homebase
timesheet_summary = pd.read_csv('../data/raw/Summary_QuikMed Urgent Care-2021-10-06_2021-10-19_timesheets.csv', header=2)
timesheet_summary

,First Name,Last Name,Role,Wage Rate,Actual Hours,Scheduled Hours,Actual & Scheduled Diff
0,Alaynah,Bowman,Receptionist,$14.00,12.50,12.0,0.50
1,Alyssa,Bowman,Receptionist,$14.00,37.50,36.5,1.00
2,Carlos,Smith,Receptionist,$15.00,0.00,0.0,0.00
3,Carrie,Guga,PA,NaN,76.00,76.0,0.00
4,Carrie,Lewandowski,Office Admin,$16.00,5.00,12.0,-7.00
5,Cassidy,Davis,Nurse,$18.00,75.25,68.0,7.25
6,Chelby,Davis,Receptionist,$15.00,82.00,80.0,2.00
7,Debra,Russell,Nurse,$20.00,9.50,9.5,0.00
8,Jodie,Ewing,Nurse,$20.00,43.50,43.5,0.00
9,Kristy,Knight,Nurse,$18.00,24.00,24.0,0.00
10,Lucie,Tatum,Nurse,$18.00,28.00,28.0,0.00
11,Mia,Kelly,COVID,$13.00,26.00,27.0,-1.00
12,Milly,Smith,PA,NaN,48.00,48.0,0.00
13,Rebecca,Wisner,Receptionist,$14.00,16.00,16.0,0.00
14,Rick,Tontarski,PA,$50.00,16.00,16.0,0.00
15,Tricia,Loomis,Nurse,$18.00,50.50,47.0,3.50
16,Total,NaN,NaN,NaN,549.75,543.5,6.25

> Remember that the above csv file has the payroll period dates, which will be useful when saving the final csv. 
> When writing the script there must also be a way for the user to either input the file they are trying to convert, or some other method so that the script knows which csv file it needs to run on.

In [6]:
# Remove unneeded columns
timesheet_summary.drop(columns=['Actual & Scheduled Diff', 'Scheduled Hours'], inplace=True)
timesheet_summary

   First Name    Last Name          Role Wage Rate  Actual Hours
0     Alaynah       Bowman  Receptionist    $14.00         12.50
1      Alyssa       Bowman  Receptionist    $14.00         37.50
2      Carlos        Smith  Receptionist    $15.00          0.00
3      Carrie         Guga            PA       NaN         76.00
4      Carrie  Lewandowski  Office Admin    $16.00          5.00
5     Cassidy        Davis         Nurse    $18.00         75.25
6      Chelby        Davis  Receptionist    $15.00         82.00
7       Debra      Russell         Nurse    $20.00          9.50
8       Jodie        Ewing         Nurse    $20.00         43.50
9      Kristy       Knight         Nurse    $18.00         24.00
10      Lucie        Tatum         Nurse    $18.00         28.00
11        Mia        Kelly         COVID    $13.00         26.00
12      Milly        Smith            PA       NaN         48.00
13    Rebecca       Wisner  Receptionist    $14.00         16.00
14       Rick    Tontarski            PA    $50.00         16.00
15     Tricia       Loomis         Nurse    $18.00         50.50
16      Total          NaN           NaN       NaN        549.75

In [7]:
# Merge first and last name columns, and rearange columns.
timesheet_summary['Employee'] = timesheet_summary['First Name'] + ' ' + timesheet_summary['Last Name']

timesheet_summary.drop(columns=['First Name', 'Last Name'], inplace=True)
timesheet_summary = timesheet_summary[['Employee', 'Role', 'Wage Rate', 'Actual Hours']]

timesheet_summary

              Employee          Role Wage Rate  Actual Hours
0       Alaynah Bowman  Receptionist    $14.00         12.50
1        Alyssa Bowman  Receptionist    $14.00         37.50
2         Carlos Smith  Receptionist    $15.00          0.00
3          Carrie Guga            PA       NaN         76.00
4   Carrie Lewandowski  Office Admin    $16.00          5.00
5        Cassidy Davis         Nurse    $18.00         75.25
6         Chelby Davis  Receptionist    $15.00         82.00
7        Debra Russell         Nurse    $20.00          9.50
8          Jodie Ewing         Nurse    $20.00         43.50
9        Kristy Knight         Nurse    $18.00         24.00
10         Lucie Tatum         Nurse    $18.00         28.00
11           Mia Kelly         COVID    $13.00         26.00
12         Milly Smith            PA       NaN         48.00
13      Rebecca Wisner  Receptionist    $14.00         16.00
14      Rick Tontarski            PA    $50.00         16.00
15       Tricia Loomis         Nurse    $18.00         50.50
16                 NaN           NaN       NaN        549.75

In [8]:
# Rename columns
timesheet_summary.rename(columns={'Wage Rate':'Pay Rate', 'Actual Hours':'Hours'}, inplace=True)
timesheet_summary

              Employee          Role Pay Rate   Hours
0       Alaynah Bowman  Receptionist   $14.00   12.50
1        Alyssa Bowman  Receptionist   $14.00   37.50
2         Carlos Smith  Receptionist   $15.00    0.00
3          Carrie Guga            PA      NaN   76.00
4   Carrie Lewandowski  Office Admin   $16.00    5.00
5        Cassidy Davis         Nurse   $18.00   75.25
6         Chelby Davis  Receptionist   $15.00   82.00
7        Debra Russell         Nurse   $20.00    9.50
8          Jodie Ewing         Nurse   $20.00   43.50
9        Kristy Knight         Nurse   $18.00   24.00
10         Lucie Tatum         Nurse   $18.00   28.00
11           Mia Kelly         COVID   $13.00   26.00
12         Milly Smith            PA      NaN   48.00
13      Rebecca Wisner  Receptionist   $14.00   16.00
14      Rick Tontarski            PA   $50.00   16.00
15       Tricia Loomis         Nurse   $18.00   50.50
16                 NaN           NaN      NaN  549.75

> Split the summary csv into 2 dataframes, 1 for Wellness Physician Care Payroll and 1 for CEI Real Estate Payroll

In [9]:
# Wellness payroll
wellness_emp = ['Debra Russell', 
                'Jodie Ewing', 
                'Kristy Knight', 
                'Lucie Tatum', 
                'Cassidy Davis', 
                'Tricia Loomis', 
                'Rick Tontarski',
                'Carrie Guga',
                'Milly Smith']
wellness_role = ['PA', 'Nurse']
wellness_payroll = timesheet_summary.query('Employee in @wellness_emp or Role in @wellness_role')

# reset index
wellness_payroll.reset_index(drop=True, inplace=True)
wellness_payroll

         Employee   Role Pay Rate  Hours
0     Carrie Guga     PA      NaN  76.00
1   Cassidy Davis  Nurse   $18.00  75.25
2   Debra Russell  Nurse   $20.00   9.50
3     Jodie Ewing  Nurse   $20.00  43.50
4   Kristy Knight  Nurse   $18.00  24.00
5     Lucie Tatum  Nurse   $18.00  28.00
6     Milly Smith     PA      NaN  48.00
7  Rick Tontarski     PA   $50.00  16.00
8   Tricia Loomis  Nurse   $18.00  50.50

In [10]:
# Edit Milly's and Carrie's pay rate and hours
wellness_payroll.loc[wellness_payroll['Employee']=='Carrie Guga', 'Pay Rate'] = '$4900'
wellness_payroll.loc[wellness_payroll['Employee']=='Carrie Guga', 'Hours'] = 1

wellness_payroll.loc[wellness_payroll['Employee']=='Milly Smith', 'Pay Rate'] = '$5000'
wellness_payroll.loc[wellness_payroll['Employee']=='Milly Smith', 'Hours'] = 1

wellness_payroll

C:\Users\mcmco\anaconda3\lib\site-packages\pandas\core\indexing.py:966: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

         Employee   Role Pay Rate  Hours
0     Carrie Guga     PA    $4900   1.00
1   Cassidy Davis  Nurse   $18.00  75.25
2   Debra Russell  Nurse   $20.00   9.50
3     Jodie Ewing  Nurse   $20.00  43.50
4   Kristy Knight  Nurse   $18.00  24.00
5     Lucie Tatum  Nurse   $18.00  28.00
6     Milly Smith     PA    $5000   1.00
7  Rick Tontarski     PA   $50.00  16.00
8   Tricia Loomis  Nurse   $18.00  50.50

In [11]:
# remove dollar signs.
wellness_payroll['Pay Rate'] = wellness_payroll['Pay Rate'].str[1:]
wellness_payroll

C:\Users\mcmco\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

         Employee   Role Pay Rate  Hours
0     Carrie Guga     PA     4900   1.00
1   Cassidy Davis  Nurse    18.00  75.25
2   Debra Russell  Nurse    20.00   9.50
3     Jodie Ewing  Nurse    20.00  43.50
4   Kristy Knight  Nurse    18.00  24.00
5     Lucie Tatum  Nurse    18.00  28.00
6     Milly Smith     PA     5000   1.00
7  Rick Tontarski     PA    50.00  16.00
8   Tricia Loomis  Nurse    18.00  50.50

In [12]:
# convert pay rate values to floats
wellness_payroll['Pay Rate'] = wellness_payroll['Pay Rate'].astype('float64')

C:\Users\mcmco\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [13]:
wellness_payroll.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Employee  9 non-null      object
 1   Role      9 non-null      object
 2   Pay Rate  9 non-null      float64
 3   Hours     9 non-null      float64
dtypes: float64(2), object(2)
memory usage: 416.0+ bytes

In [30]:
# apply function for payroll amount. 

wellness_payroll['Payroll Amount'] = wellness_payroll.apply(lambda x: payroll_amt(x['Pay Rate'], x['Hours']), axis=1)
wellness_payroll

C:\Users\mcmco\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

         Employee   Role  Pay Rate  Hours  Payroll Amount
0     Carrie Guga     PA    4900.0   1.00          4900.0
1   Cassidy Davis  Nurse      18.0  75.25          1354.5
2   Debra Russell  Nurse      20.0   9.50           190.0
3     Jodie Ewing  Nurse      20.0  43.50           870.0
4   Kristy Knight  Nurse      18.0  24.00           432.0
5     Lucie Tatum  Nurse      18.0  28.00           504.0
6     Milly Smith     PA    5000.0   1.00          5000.0
7  Rick Tontarski     PA      50.0  16.00           800.0
8   Tricia Loomis  Nurse      18.0  50.50           909.0

In [31]:
# add notes column
wellness_payroll['Notes'] = ''
wellness_payroll

C:\Users\mcmco\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

         Employee   Role  Pay Rate  Hours  Payroll Amount Notes
0     Carrie Guga     PA    4900.0   1.00          4900.0
1   Cassidy Davis  Nurse      18.0  75.25          1354.5
2   Debra Russell  Nurse      20.0   9.50           190.0
3     Jodie Ewing  Nurse      20.0  43.50           870.0
4   Kristy Knight  Nurse      18.0  24.00           432.0
5     Lucie Tatum  Nurse      18.0  28.00           504.0
6     Milly Smith     PA    5000.0   1.00          5000.0
7  Rick Tontarski     PA      50.0  16.00           800.0
8   Tricia Loomis  Nurse      18.0  50.50           909.0

In [32]:
# Add Janney Montgomery notes for Carrie and Milly
wellness_payroll.loc[wellness_payroll['Employee']=='Carrie Guga', 'Notes'] = 'Janney Montgomery'
wellness_payroll.loc[wellness_payroll['Employee']=='Milly Smith', 'Notes'] = 'Janney Montgomery'
wellness_payroll

C:\Users\mcmco\anaconda3\lib\site-packages\pandas\core\indexing.py:966: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

         Employee   Role  Pay Rate  Hours  Payroll Amount              Notes
0     Carrie Guga     PA    4900.0   1.00          4900.0  Janney Montgomery
1   Cassidy Davis  Nurse      18.0  75.25          1354.5
2   Debra Russell  Nurse      20.0   9.50           190.0
3     Jodie Ewing  Nurse      20.0  43.50           870.0
4   Kristy Knight  Nurse      18.0  24.00           432.0
5     Lucie Tatum  Nurse      18.0  28.00           504.0
6     Milly Smith     PA    5000.0   1.00          5000.0  Janney Montgomery
7  Rick Tontarski     PA      50.0  16.00           800.0
8   Tricia Loomis  Nurse      18.0  50.50           909.0

In [33]:
# check for and add overtime note if needed. 
wellness_payroll.loc[wellness_payroll['Hours'] > 80, 'Notes'] = 'Overtime'

C:\Users\mcmco\anaconda3\lib\site-packages\pandas\core\indexing.py:966: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

In [34]:
# Lastly, drop the role column. It is no longer needed. 
wellness_payroll.drop(columns='Role', inplace=True)

C:\Users\mcmco\anaconda3\lib\site-packages\pandas\core\frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [36]:
# sort employees by hours worked
wellness_payroll = wellness_payroll.sort_values(by=['Hours'], ascending=False).reset_index(drop=True)

In [37]:
wellness_payroll

         Employee  Pay Rate  Hours  Payroll Amount              Notes
0   Cassidy Davis      18.0  75.25          1354.5
1   Tricia Loomis      18.0  50.50           909.0
2     Jodie Ewing      20.0  43.50           870.0
3     Lucie Tatum      18.0  28.00           504.0
4   Kristy Knight      18.0  24.00           432.0
5  Rick Tontarski      50.0  16.00           800.0
6   Debra Russell      20.0   9.50           190.0
7     Carrie Guga    4900.0   1.00          4900.0  Janney Montgomery
8     Milly Smith    5000.0   1.00          5000.0  Janney Montgomery

> Looks good.

-------

In [15]:
# CEI payroll
cei_emp = ['Alaynah Bowman', 
           'Alyssa Bowman',
           'Rebecca Wisner',
           'Chelby Davis',
           'Mia Kelly', 
           'Carrie Lewandowski']
cei_role = ['Receptionist', 'COVID', 'Office Admin']
cei_payroll = timesheet_summary.query('Employee in @ cei_emp or Role in @cei_role')

#reset index
cei_payroll.reset_index(drop=True, inplace=True)
cei_payroll

             Employee          Role Pay Rate  Hours
0      Alaynah Bowman  Receptionist   $14.00   12.5
1       Alyssa Bowman  Receptionist   $14.00   37.5
2        Carlos Smith  Receptionist   $15.00    0.0
3  Carrie Lewandowski  Office Admin   $16.00    5.0
4        Chelby Davis  Receptionist   $15.00   82.0
5           Mia Kelly         COVID   $13.00   26.0
6      Rebecca Wisner  Receptionist   $14.00   16.0

In [16]:
# Edit Carlos Smith's pay rate and hours. 
cei_payroll.loc[cei_payroll['Employee']=='Carlos Smith', 'Pay Rate'] = '$2000'
cei_payroll.loc[cei_payroll['Employee']=='Carlos Smith', 'Hours'] = 1

cei_payroll

C:\Users\mcmco\anaconda3\lib\site-packages\pandas\core\indexing.py:966: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

             Employee          Role Pay Rate  Hours
0      Alaynah Bowman  Receptionist   $14.00   12.5
1       Alyssa Bowman  Receptionist   $14.00   37.5
2        Carlos Smith  Receptionist    $2000    1.0
3  Carrie Lewandowski  Office Admin   $16.00    5.0
4        Chelby Davis  Receptionist   $15.00   82.0
5           Mia Kelly         COVID   $13.00   26.0
6      Rebecca Wisner  Receptionist   $14.00   16.0

In [17]:
# remove dollar signs.
cei_payroll['Pay Rate'] = cei_payroll['Pay Rate'].str[1:]

C:\Users\mcmco\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [18]:
# convert pay rate values to floats
cei_payroll['Pay Rate'] = cei_payroll['Pay Rate'].astype('float64')

C:\Users\mcmco\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [19]:
cei_payroll.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Employee  7 non-null      object
 1   Role      7 non-null      object
 2   Pay Rate  7 non-null      float64
 3   Hours     7 non-null      float64
dtypes: float64(2), object(2)
memory usage: 352.0+ bytes

In [20]:
# drop role column, data no longer needed.
cei_payroll.drop(columns='Role', inplace=True)

C:\Users\mcmco\anaconda3\lib\site-packages\pandas\core\frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [21]:
# Add other salaried employees
salary_employees =[{'Employee':'Cassidy Davis',
                    'Pay Rate':18.0,
                    'Hours':40},
                   {'Employee':'Shannon Herbert',
                    'Pay Rate':18.0,
                    'Hours':20},
                   {'Employee':'MaryJo Rogers',
                    'Pay Rate':20.0,
                    'Hours':28},
                   {'Employee':'Estevan Smith',
                    'Pay Rate':600.0,
                    'Hours':1},
                   {'Employee':'Iliana Smith',
                    'Pay Rate':600.0,
                    'Hours':1}]

for employee in salary_employees:
    cei_payroll = cei_payroll.append(employee, ignore_index=True)

cei_payroll

              Employee  Pay Rate  Hours
0       Alaynah Bowman      14.0   12.5
1        Alyssa Bowman      14.0   37.5
2         Carlos Smith    2000.0    1.0
3   Carrie Lewandowski      16.0    5.0
4         Chelby Davis      15.0   82.0
5            Mia Kelly      13.0   26.0
6       Rebecca Wisner      14.0   16.0
7        Cassidy Davis      18.0   40.0
8      Shannon Herbert      18.0   20.0
9        MaryJo Rogers      20.0   28.0
10       Estevan Smith     600.0    1.0
11        Iliana Smith     600.0    1.0

In [25]:
# sort employees by hours worked
cei_payroll = cei_payroll.sort_values(by=['Hours'], ascending=False).reset_index(drop=True)

In [26]:
# calculate payroll amount for each employee. 

def payroll_amt(pay_rate, hours):
    if hours > 80:
        amount = 80 * pay_rate + ((hours-80) * (pay_rate*1.5))
        return amount
    else:
        amount = pay_rate * hours
        return amount

cei_payroll['Payroll Amount'] = cei_payroll.apply(lambda x: payroll_amt(x['Pay Rate'], x['Hours']), axis=1)
cei_payroll

              Employee  Pay Rate  Hours  Payroll Amount
0         Chelby Davis      15.0   82.0          1245.0
1        Cassidy Davis      18.0   40.0           720.0
2        Alyssa Bowman      14.0   37.5           525.0
3        MaryJo Rogers      20.0   28.0           560.0
4            Mia Kelly      13.0   26.0           338.0
5      Shannon Herbert      18.0   20.0           360.0
6       Rebecca Wisner      14.0   16.0           224.0
7       Alaynah Bowman      14.0   12.5           175.0
8   Carrie Lewandowski      16.0    5.0            80.0
9         Carlos Smith    2000.0    1.0          2000.0
10       Estevan Smith     600.0    1.0           600.0
11        Iliana Smith     600.0    1.0           600.0

In [27]:
# add notes column
cei_payroll['Notes'] = ''

In [28]:
# check for and add overtime note if needed. 
cei_payroll.loc[cei_payroll['Hours'] > 80, 'Notes'] = 'Overtime'

In [29]:
cei_payroll

              Employee  Pay Rate  Hours  Payroll Amount     Notes
0         Chelby Davis      15.0   82.0          1245.0  Overtime
1        Cassidy Davis      18.0   40.0           720.0
2        Alyssa Bowman      14.0   37.5           525.0
3        MaryJo Rogers      20.0   28.0           560.0
4            Mia Kelly      13.0   26.0           338.0
5      Shannon Herbert      18.0   20.0           360.0
6       Rebecca Wisner      14.0   16.0           224.0
7       Alaynah Bowman      14.0   12.5           175.0
8   Carrie Lewandowski      16.0    5.0            80.0
9         Carlos Smith    2000.0    1.0          2000.0
10       Estevan Smith     600.0    1.0           600.0
11        Iliana Smith     600.0    1.0           600.0

> Looks good.

------